apps/contributions/tests/fixtures/payment-intent-succeeded-webhook.json

{
    "id": "evt_fakefakefake",
    "object": "event",
    "account": "acct_fakefakefake",
    "api_version": "2020-08-27",
    "created": 1673016228,
    "data": {
      "object": {
        "id": "pi_fakefakefake",
        "object": "payment_intent",
        "amount": 1564,
        "amount_capturable": 0,
        "amount_details": {
          "tip": {
          }
        },
        "amount_received": 1564,
        "application": "ca_fakefakefake",
        "application_fee_amount": null,
        "automatic_payment_methods": null,
        "canceled_at": null,
        "cancellation_reason": null,
        "capture_method": "automatic",
        "charges": {
          "object": "list",
          "data": [
            {
              "id": "ch_fakefakefakefake",
              "object": "charge",
              "amount": 1564,
              "amount_captured": 1564,
              "amount_refunded": 0,
              "application": "ca_fakefakefake",
              "application_fee": null,
              "application_fee_amount": null,
              "balance_transaction": "txn_fakefakefake",
              "billing_details": {
                "address": {
                  "city": "Philadelphia",
                  "country": "US",
                  "line1": "2546 South Broad Street",
                  "line2": "Ap 1",
                  "postal_code": "19145",
                  "state": "Pennsylvania"
                },
                "email": "foo@fundjournalism.org",
                "name": "Foo Bar",
                "phone": "1234567890"
              },
              "calculated_statement_descriptor": "ORG.ORG",
              "captured": true,
              "created": 1673016227,
              "currency": "usd",
              "customer": "cus_fakefakefake",
              "description": "Subscription update",
              "destination": null,
              "dispute": null,
              "disputed": false,
              "failure_balance_transaction": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {
              },
              "invoice": "in_1fakefakefake",
              "livemode": false,
              "metadata": {
              },
              "on_behalf_of": null,
              "order": null,
              "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "risk_score": 41,
                "seller_message": "Payment complete.",
                "type": "authorized"
              },
              "paid": true,
              "payment_intent": "pi_fakefakefake",
              "payment_method": "pm_fakefakefake",
              "payment_method_details": {
                "card": {
                  "brand": "visa",
                  "checks": {
                    "address_line1_check": "pass",
                    "address_postal_code_check": "pass",
                    "cvc_check": null
                  },
                  "country": "US",
                  "exp_month": 4,
                  "exp_year": 2024,
                  "fingerprint": "fakefakefake",
                  "funding": "credit",
                  "installments": null,
                  "last4": "4242",
                  "mandate": null,
                  "network": "visa",
                  "three_d_secure": null,
                  "wallet": null
                },
                "type": "card"
              },
              "receipt_email": null,
              "receipt_number": null,
              "receipt_url": "https://pay.stripe.com/receipts/invoices/fakefakefake?s=ap",
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [
                ],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_fakefakefakefake/refunds"
              },
              "review": null,
              "shipping": null,
              "source": null,
              "source_transfer": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "succeeded",
              "transfer_data": null,
              "transfer_group": null
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/charges?payment_intent=pi_fakefakefake"
        },
        "client_secret": "pi_fakefakefake_secret_fakefakefake",
        "confirmation_method": "automatic",
        "created": 1673016227,
        "currency": "usd",
        "customer": "cus_fakefakefake",
        "description": "Subscription update",
        "invoice": "in_1fakefakefake",
        "last_payment_error": null,
        "livemode": false,
        "metadata": {
        },
        "next_action": null,
        "on_behalf_of": null,
        "payment_method": "pm_fakefakefake",
        "payment_method_options": {
          "card": {
            "installments": null,
            "mandate_options": null,
            "network": null,
            "request_three_d_secure": "automatic"
          }
        },
        "payment_method_types": [
          "card"
        ],
        "processing": null,
        "receipt_email": null,
        "review": null,
        "setup_future_usage": null,
        "shipping": null,
        "source": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "succeeded",
        "transfer_data": null,
        "transfer_group": null
      }
    },
    "livemode": false,
    "pending_webhooks": 15,
    "request": {
      "id": null,
      "idempotency_key": "in_1fakefakefake-initial_attempt-6bfb1a9bbbb5714ce"
    },
    "type": "payment_intent.succeeded"
  }
